tap "hashicorp/tap"
brew "astro"
brew "autoconf"
brew "automake"
brew "bat"
brew "cairo"
brew "coreutils"
brew "cpptoml"
brew "dockutil"
brew "eza"
brew "fzf"
brew "libksba"
brew "libtool"
brew "libyaml"
brew "lsd"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "pkgconf"
brew "readline"
brew "poetry"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "ruby"
brew "starship"
brew "stow"
brew "terraform"
brew "terraform-docs"
brew "tree"
brew "uv"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zplug"
cask "1password"
cask "alt-tab"
cask "appcleaner"
cask "brave-browser"
cask "caffeine"
cask "claude"
cask "cursor"
cask "dbeaver-community"
cask "docker"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hiddenbar"
cask "iterm2"
cask "postman"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "slack"
cask "stats"
cask "superwhisper"
cask "utm"
cask "visual-studio-code"
cask "virtualbox"
cask "vivaldi"
cask "whatsapp"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "akarlsten.vscode-snazzy-akarlsten"
vscode "altimateai.datapilot-mcp-server-tools-ext"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "avetis.mono-atom"
vscode "azemoh.one-monokai"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "catppuccin.catppuccin-vsc"
vscode "codium.codium"
vscode "docker.docker"
vscode "dorzey.vscode-sqlfluff"
vscode "eamodio.gitlens"
vscode "evidence.sqltools-bigquery-driver"
vscode "faceair.ayu-one-dark"
vscode "file-icons.file-icons"
vscode "fosshaas.fontsize-shortcuts"
vscode "gaulomatic.vscode-icontheme-nomo-dark-macos"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "igorsbitnev.error-gutters"
vscode "innoverio.vscode-dbt-power-user"
vscode "jkiviluoto.tws"
vscode "johnpapa.vscode-peacock"
vscode "maciejdems.add-to-gitignore"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools-themes"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "whizkydee.material-palenight-theme"
vscode "willi84.vikings-icon-theme"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
